In [5]:
import pandas as pd

csv_path = ("Books.csv")
df = pd.read_csv(csv_path)
df.head()

                              Name of Book                Author   Date
0                    To Kill A Mockingbird           Harpers Lee   1960
1                  A Brief History Of Time       Stephen Hawking   1988
2                         The Great Gatsby   F. Scott Fitzgerald   1922
3  The Man Who Mistook His Wife for a Hat           Oliver Sacks   1985
4                     Pride and Prejudice            Jane Austen   1813

In [9]:
dictionary = {"J-Nissi":[2014], "BMJS":[2020], "PAU":[2024]}

df = pd.DataFrame(dictionary)
df.head()

   J-Nissi  BMJS   PAU
0     2014  2020  2024

In [14]:
x = {'Name': ['Rose','John', 'Jane', 'Mary', 'Anna', 'Hope'], 'ID': [1, 2, 3, 4, 5, 6], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure', 'Engineering', 'Drama'], 
      'Salary':[100000, 80000, 50000, 60000, 70000, 80000]}
df = pd.DataFrame(x)
df.head()

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000
4  Anna   5      Engineering   70000

In [12]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [15]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4
4      Engineering   70000   5
5            Drama   80000   6

In [20]:
y = df['Name']
y

0    Rose
1    John
2    Jane
3    Mary
4    Anna
5    Hope
Name: Name, dtype: object

In [21]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'Rose'

In [22]:
# Access the value on the first row and the third column

df.iloc[0,2]

'Architect Group'

In [23]:
# Access the column using the name

df.loc[0, 'Salary']

100000

In [36]:
df2=df
# df2=df2.set_index("ID")
df2.head()

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000
4  Anna   5      Engineering   70000

In [41]:
#Now, let us access the column using the name
df.loc[2, 'Salary']

50000

In [44]:
df.iloc[0:3, 0]

0    Rose
1    John
2    Jane
Name: Name, dtype: object